// C# Seminar 5. HomeWork.

// Task 1. Задайте массив заполненный случайными положительными трёхзначными числами. 
// Напишите программу, которая покажет количество чётных чисел в массиве.



// Task 2. Задайте одномерный массив, заполненный случайными числами. 
// Найдите сумму элементов, стоящих на нечётных позициях.



// Task 3. Задайте массив вещественных чисел. 
// Найдите разницу между максимальным и минимальным элементов массива.

// Var.1 - Single complex function



// Var.2 - Two simple functions
